Revit 2027 API
BuiltInFailures.StairRampFailures.CannotGenerateRampError Property
 Couldn't generate surfaces for ramp.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotGenerateRampError { get; }
Public Shared ReadOnly Property CannotGenerateRampError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotGenerateRampError {
	FailureDefinitionId^ get ();
}
static member CannotGenerateRampError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace